<template>
    <div class="chart-wapper dark large">
        <IntervalChart 
            :data="data" 
            seriesField="type" 
            theme="blueDark.mirror" 
            :axis="axis"
            transpose="mirror"></IntervalChart>
    </div>
</template>
<script setup>
// 图表的数据
const data = [
{ x: '11-15', y: 10, type: '时间' },
    { x: '11-16', y: 2, type: '时间' },
    { x: '11-17', y: 8, type: '时间' },
    { x: '11-18', y: 25, type: '时间' },
    { x: '11-19', y: 10, type: '时间' },
    { x: '11-20', y: 15, type: '时间' },
    { x: '11-21', y: 18, type: '时间' },
    { x: '11-22', y: 10, type: '时间' },
    { x: '11-23', y: 2, type: '时间' },
    { x: '11-24', y: 8, type: '时间' },
    { x: '11-25', y: 25, type: '时间' },
    { x: '11-26', y: 10, type: '时间' },
    { x: '11-27', y: 15, type: '时间' },
    { x: '11-28', y: 18, type: '时间' },
    { x: '11-29', y: 10, type: '时间' },
    { x: '11-30', y: 2, type: '时间' },
    { x: '12-01', y: 8, type: '时间' },
    { x: '12-02', y: 25, type: '时间' },
    { x: '12-03', y: 10, type: '时间' },
    { x: '12-04', y: 15, type: '时间' },
    { x: '12-05', y: 18, type: '时间' },
    { x: '12-06', y: 10, type: '时间' },
    { x: '12-07', y: 2, type: '时间' },
    { x: '12-08', y: 8, type: '时间' },
    { x: '12-09', y: 25, type: '时间' },
    { x: '12-10', y: 10, type: '时间' },
    { x: '12-11', y: 15, type: '时间' },
    { x: '12-12', y: 18, type: '时间' },
    { x: '12-13', y: 10, type: '时间' },
    { x: '12-14', y: 2, type: '时间' },
    { x: '12-15', y: 8, type: '时间' },
    { x: '12-16', y: 25, type: '时间' },
    { x: '12-17', y: 10, type: '时间' },
    { x: '12-18', y: 15, type: '时间' },
    { x: '12-19', y: 18, type: '时间' },
    { x: '12-20', y: 10, type: '时间' },
    { x: '12-21', y: 2, type: '时间' },
    { x: '11-15', y: 8, type: '次数' },
    { x: '11-16', y: 9, type: '次数' },
    { x: '11-17', y: 22, type: '次数' },
    { x: '11-18', y: 4, type: '次数' },
    { x: '11-19', y: 0, type: '次数' },
    { x: '11-20', y: 5, type: '次数' },
    { x: '11-21', y: 5, type: '次数' },
    { x: '11-22', y: 33, type: '次数' },
    { x: '11-23', y: 31, type: '次数' },
    { x: '11-24', y: 5, type: '次数' },
    { x: '11-25', y: 12, type: '次数' },
    { x: '11-26', y: 67, type: '次数' },
    { x: '11-27', y: 7, type: '次数' },
    { x: '11-28', y: 1, type: '次数' },
    { x: '11-29', y: 10, type: '次数' },
    { x: '11-30', y: 2, type: '次数' },
    { x: '12-01', y: 8, type: '次数' },
    { x: '12-02', y: 25, type: '次数' },
    { x: '12-03', y: 1, type: '次数' },
    { x: '12-04', y: 15, type: '次数' },
    { x: '12-05', y: 18, type: '次数' },
    { x: '12-06', y: 10, type: '次数' },
    { x: '12-07', y: 2, type: '次数' },
    { x: '12-08', y: 8, type: '次数' },
    { x: '12-09', y: 25, type: '次数' },
    { x: '12-10', y: 10, type: '次数' },
    { x: '12-11', y: 15, type: '次数' },
    { x: '12-12', y: 18, type: '次数' },
    { x: '12-13', y: 10, type: '次数' },
    { x: '12-14', y: 2, type: '次数' },
    { x: '12-15', y: 8, type: '次数' },
    { x: '12-16', y: 25, type: '次数' },
    { x: '12-17', y: 10, type: '次数' },
    { x: '12-18', y: 15, type: '次数' },
    { x: '12-19', y: 18, type: '次数' },
    { x: '12-20', y: 0, type: '次数' },
    { x: '12-21', y: 2, type: '次数' },
];

const axis = {
    yAxis: {
        // 需要调整position参数，而不需要传递其他的参数，其他的参数都在主题中
        // 也可以自定义值覆盖主题中的默认配置
        unit: [
            {
                content: '单位1',
                position: ['-4.5%', '-25%'],
            },
            {
                content: '单位2',
                position: ['-4.5%', '135%'], // 调整文字位置
            },
        ]
    }
}
</script>